
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УслугаСортировкиУслуги.НомерГрузовогоМеста КАК НомерГрузовогоМеста,
	|	УслугаСортировкиУслуги.ЗаказКлиента КАК ЗаказКлиента,
	|	ЕСТЬNULL(ТарифыОбработки.Тариф, ТарифыОбработкиСрезПоследних.Тариф) КАК ТарифОбработка,
	|	ЕСТЬNULL(ТарифыХранения.Тариф, ТарифыХраненияСрезПоследних.Тариф) КАК ТарифХранение,
	|	КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня) КАК КоличествоПраздничныеДни,
	|	ВЫБОР
	|		КОГДА УслугаСортировкиУслуги.КоличествоЧасы < 24
	|			ТОГДА 0
	|		КОГДА УслугаСортировкиУслуги.КоличествоЧасы <= 36
	|			ТОГДА ЕСТЬNULL(ТарифыХранения.Тариф, ТарифыХраненияСрезПоследних.Тариф)
	|		ИНАЧЕ ЕСТЬNULL(ТарифыХранения.Тариф, ТарифыХраненияСрезПоследних.Тариф) * 2 *
	|			КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня) + ЕСТЬNULL(ТарифыХранения.Тариф,
	|			ТарифыХраненияСрезПоследних.Тариф) * (УслугаСортировкиУслуги.КоличествоДни -
	|			КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня))
	|	КОНЕЦ КАК СуммаХранение,
	|	ЕСТЬNULL(ТарифыОбработки.Тариф, ТарифыОбработкиСрезПоследних.Тариф) * 2 *
	|		КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня) + ЕСТЬNULL(ТарифыОбработки.Тариф,
	|		ТарифыОбработкиСрезПоследних.Тариф) * (УслугаСортировкиУслуги.КоличествоДни -
	|		КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня)) КАК СуммаОбработка,
	|	УслугаСортировкиУслуги.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА УслугаСортировкиУслуги.КоличествоЧасы < 24
	|			ТОГДА 0
	|		КОГДА УслугаСортировкиУслуги.КоличествоЧасы <= 36
	|			ТОГДА ЕСТЬNULL(ТарифыХранения.Тариф, ТарифыХраненияСрезПоследних.Тариф)
	|		ИНАЧЕ ЕСТЬNULL(ТарифыХранения.Тариф, ТарифыХраненияСрезПоследних.Тариф) * 2 *
	|			КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня) + ЕСТЬNULL(ТарифыХранения.Тариф,
	|			ТарифыХраненияСрезПоследних.Тариф) * (УслугаСортировкиУслуги.КоличествоДни -
	|			КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня))
	|	КОНЕЦ + ЕСТЬNULL(ТарифыОбработки.Тариф, ТарифыОбработкиСрезПоследних.Тариф) * 2 *
	|		КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня) + ЕСТЬNULL(ТарифыОбработки.Тариф,
	|		ТарифыОбработкиСрезПоследних.Тариф) * (УслугаСортировкиУслуги.КоличествоДни -
	|		КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня)) КАК Сумма,
	|	УслугаСортировкиУслуги.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.УслугаСортировки.Услуги КАК УслугаСортировкиУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|		ПО ДанныеПроизводственногоКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(УслугаСортировкиУслуги.ДатаВремяПрибытие,
	|			ДЕНЬ) И УслугаСортировкиУслуги.ДатаВремяУбытие
	|		И НЕ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыХранения КАК ТарифыХранения
	|		ПО НАЧАЛОПЕРИОДА(УслугаСортировкиУслуги.ДатаВремяПрибытие, МЕСЯЦ) = ТарифыХранения.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыОбработки КАК ТарифыОбработки
	|		ПО НАЧАЛОПЕРИОДА(УслугаСортировкиУслуги.ДатаВремяПрибытие, МЕСЯЦ) = ТарифыОбработки.Период
	|		И УслугаСортировкиУслуги.ТипГрузовогоМеста = ТарифыОбработки.ТипГрузовогоМеста
	|		И ВЫБОР
	|			КОГДА УслугаСортировкиУслуги.ТипГрузовогоМеста = ЗНАЧЕНИЕ(Перечисление.ТипыГрузовыхМест.Хаб)
	|				ТОГДА УслугаСортировкиУслуги.СреднедневноеКоличество > ТарифыОбработки.ТарифХаба.От
	|				И УслугаСортировкиУслуги.СреднедневноеКоличество <= ТарифыОбработки.ТарифХаба.До
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыХранения.СрезПоследних КАК ТарифыХраненияСрезПоследних
	|		ПО ИСТИНА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыОбработки.СрезПоследних КАК ТарифыОбработкиСрезПоследних
	|		ПО УслугаСортировкиУслуги.ТипГрузовогоМеста = ТарифыОбработкиСрезПоследних.ТипГрузовогоМеста
	|		И ВЫБОР
	|			КОГДА УслугаСортировкиУслуги.ТипГрузовогоМеста = ЗНАЧЕНИЕ(Перечисление.ТипыГрузовыхМест.Хаб)
	|				ТОГДА УслугаСортировкиУслуги.СреднедневноеКоличество > ТарифыОбработкиСрезПоследних.ТарифХаба.От
	|				И УслугаСортировкиУслуги.СреднедневноеКоличество <= ТарифыОбработкиСрезПоследних.ТарифХаба.До
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|ГДЕ
	|	УслугаСортировкиУслуги.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	УслугаСортировкиУслуги.НомерГрузовогоМеста,
	|	УслугаСортировкиУслуги.ЗаказКлиента,
	|	УслугаСортировкиУслуги.КоличествоДни,
	|	УслугаСортировкиУслуги.КоличествоЧасы,
	|	ЕСТЬNULL(ТарифыХранения.Тариф, ТарифыХраненияСрезПоследних.Тариф),
	|	ЕСТЬNULL(ТарифыОбработки.Тариф, ТарифыОбработкиСрезПоследних.Тариф),
	|	ТарифыХранения.Тариф,
	|	ТарифыХраненияСрезПоследних.Тариф,
	|	ТарифыОбработки.Тариф,
	|	ТарифыОбработкиСрезПоследних.Тариф,
	|	УслугаСортировкиУслуги.Ссылка,
	|	УслугаСортировкиУслуги.Ссылка.Дата";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	НаборЗаписей = РегистрыНакопления.УслугиСортировки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
