
#Область ПрограммныйИнтерфейс
// Проводит документ УслугаСортировки в фоне.
// Параметры:
// ТаблицаУслугаСортировки - ТаблицаЗначений - колонки аналогичны таблице услуги документа УслугаСортировки.
//
Процедура ПровестиДокументУслугаСортировки(ТаблицаУслугаСортировки) Экспорт
	ДокументУслугаСортировки = Документы.УслугаСортировки.СоздатьДокумент();
	ДокументУслугаСортировки.Услуги.Загрузить(ТаблицаУслугаСортировки);
	ДокументУслугаСортировки.дата = ТекущаяДатаСеанса();
	ДокументУслугаСортировки.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры
#КонецОбласти	